INSERT INTO class 
VALUES 
	('C002', '가상화폐'),
	('C003', '스마트팩토리'),
	('C004', '주짓수'),
	('C005', '경영학원론'),
	('C006', '국제금융론'),
	('C007', '핵물리학');



SELECT * FROM class;

INSERT INTO criteria 
VALUES
	('L001', 10, 45, 45, null),
	('L002', 10, 40, 40, 10),
	('L003', 10, 30, 30, 30),
	('L004', 10, 40, 50, null),
	('L005', 10, 35, 35, 20),
	('L006', 10, NULL , 50, 40),
	('L007', 5, 45, 45, 5);



ALTER TABLE professor 
MODIFY COLUMN professor_phone varchar(255);


INSERT INTO professor 
VALUES
	('P001', '이상우', '5858', '101'),
	('P002', '일론머스크', '1667', '102'),
	('P003', '스티븐잡스', '1588', '103'),
	('P004', '마크저커버그', '1577', '104'),
	('P005', '빌게이츠', '1004', '105'),
	('P006', '워렌버핏', '2023', '106'),
	('P007', '오펜하이머', '3667', '107');
	

SELECT * FROM professor ;


SELECT * FROM application  ;

INSERT INTO application 
VALUES
	('A001', 'S001', 'L001', 'C0'),
	('A002', 'S001', 'L007', 'A+'),
	('A003', 'S002', 'L002', 'A+'),
	('A004', 'S002', 'L006', 'B+'),
	('A005', 'S003', 'L001', 'A+'),
	('A006', 'S003', 'L004', 'B+'),
	('A007', 'S004', 'L003', 'D+'),
	('A008', 'S004', 'L007', 'F'),
	('A009', 'S005', 'L001', 'C0'),
	('A010', 'S006', 'L005', 'D0'),
	('A011', 'S006', 'L006', 'D0'),
	('A012', 'S007', 'L004', 'A+'),
	('A013', 'S008', 'L002', 'F'),
	('A014', 'S008', 'L003', 'B0'),
	('A015', 'S009', 'L005', 'A0'),
	('A016', 'S010', 'L007', 'A+');



